tutorials/incompressibleFluid/mixerSRF/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 3.5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 3.5;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 3.5;
    }
    rotor
    {
        type            omegaWallFunction;
        value           uniform 3.5;
    }
    outerWall
    {
        type            omegaWallFunction;
        value           uniform 3.5;
    }
    cyclic_half0
    {
        type            cyclic;
        value           uniform 3.5;
    }
    cyclic_half1
    {
        type            cyclic;
        value           uniform 3.5;
    }
}


// ************************************************************************* //
